<?php

use yii\db\Migration;

class m160222_173759_import_data extends Migration
{
    public function safeUp()
    {
        foreach(explode(PHP_EOL, $this->_getItemsOfRegion()) as $line) {
            $this->execute($line);
        }

        foreach(explode(PHP_EOL, $this->_getItemsOfSchool()) as $line) {
            $this->execute($line);
        }
    }

    public function safeDown()
    {
        return true;
    }

    private function _getItemsOfRegion()
    {
        $data=<<<EOT
INSERT INTO `region` VALUES (1,'Центрально-Міський');
INSERT INTO `region` VALUES (2,'Дзержинський');
INSERT INTO `region` VALUES (3,'Довгинцівський');
INSERT INTO `region` VALUES (4,'Саксаганський');
INSERT INTO `region` VALUES (5,'Жовтневий');
INSERT INTO `region` VALUES (6,'Тернівський');
INSERT INTO `region` VALUES (7,'Інгулецький');
EOT;
        return $data;
    }

    private function _getItemsOfSchool()
    {
        $data =<<<EOT
INSERT INTO `school` VALUES (153,'Криворізька загальноосвiтня спеціалізована школа І-ІІІ ступенів № 4 з поглибленим вивченням іноземних мов Криворізької міської ради Дніпропетровської області','Новіков Максим Леонідович',2,'74-44-02');
INSERT INTO `school` VALUES (154,'Криворізька загальноосвiтня школа І-ІІІ ступенів № 7 з поглибленим вивченням біології Криворізької міської ради Дніпропетровської області','Завалій Юрій Станіславович',2,'71-57-36');
INSERT INTO `school` VALUES (155,'Криворізька загальноосвітня школа І-ІІІ ступенів № 15 ім.М.Решетняка Криворізької міської ради Дніпропетровської області','Шевченко Валентина Григорівна',2,'407-12-81');
INSERT INTO `school` VALUES (156,'Криворiзький науково-технічний металургійний ліцей № 16 Криворізької міської ради Дніпропетровської області','Геймур Віталій Анатолійович',2,'90-73-33');
INSERT INTO `school` VALUES (157,'Kомунальний заклад "Криворiзький навчально-виховний комплекс "Загальноосвiтня школа І-ІІ ступенів - дошкільний навчальний заклад" № 18','Шаврін Олександр Сергійович',2,'43-02-32');
INSERT INTO `school` VALUES (158,'Криворізька загальноосвітня школа І-ІІІ ступенів № 26 Криворiзької міської ради Дніпропетровської області','Данилюк Вікторія Петрівна',2,'74-81-86');
INSERT INTO `school` VALUES (159,'Криворізька загальноосвітня школа І-ІІІ ступенів "Центр освіти" Криворізької міської ради Дніпропетровської області','Озеряник Сергій Юрійович',2,'71-57-36');
INSERT INTO `school` VALUES (160,'Криворізька загальноосвiтня школа І-ІІІ ступенів № 63 Криворізької міської ради Дніпропетровської області','Коцар Людмила Андріївна',2,'90-70-09');
INSERT INTO `school` VALUES (161,'Криворізька загальноосвiтня школа І-ІІІ ступенів № 66 Криворізької міської ради Дніпропетровської області','Удовіченко Володимир Васильович',2,'405-43-20');
INSERT INTO `school` VALUES (162,'Криворізька загальноосвiтня школа І-ІІІ ступенів № 69 Криворізької міської ради Дніпропетровської області','Бережна Людмила Валентинівна',2,'92-12-39');
INSERT INTO `school` VALUES (163,'Криворізька загальноосвiтня школа І-ІІІ ступенів № 75 Криворізької міської ради Дніпропетровської області','Федоров Сергій Вікторович',2,'71-74-69');
INSERT INTO `school` VALUES (164,'Криворізька гімназія № 95 Криворізької міської ради Дніпропетровської області','Шепілко Алла Іванівна',2,'90-75-54');
INSERT INTO `school` VALUES (165,'Криворізька загальноосвiтня школа І-ІІІ ступенів № 103 Криворізької міської ради Дніпропетровської області','Кеуш Людмила Миколаївна',2,'71-65-43');
INSERT INTO `school` VALUES (167,'Криворізька загальноосвітня школа-інтернат І-ІІ ступенів № 1 Криворізької міської ради Дніпропетровської області','Кисла Тетяна Анатоліївна',2,'90-76-44');
INSERT INTO `school` VALUES (168,'Криворiзький навчально-виховний комплекс «Загальноосвітня Вальдорфська школа І-ІІІ ступенів - дитячий садок»','Шульц Валентина Леонідівна',3,'71-67-45');
INSERT INTO `school` VALUES (169,'Криворiзька спеціалізована школа № 9 з поглибленим вивченням суспільно-економічних дисциплін Криворізької міської ради Дніпропетровської області','Лозівець Інеса В’ячеславівна',3,'72-06-20');
INSERT INTO `school` VALUES (170,'Криворiзька педагогічна гімназія Криворізької міської ради Дніпропетровської області','Прокоп’єва Тетяна Миколаївна',3,'71-20-14');
INSERT INTO `school` VALUES (171,'Криворізька загальноосвiтня школа І-ІІІ ступенів № 65 Криворізької міської ради Дніпропетровської області','Субота Володимир Миколайович',3,'71-66-21');
INSERT INTO `school` VALUES (172,'Криворiзький науково-технічний металургійний ліцей № 81 Криворізької міської ради Дніпропетровської області','Гетьман Ганна Борисівна',3,'91-29-41');
INSERT INTO `school` VALUES (173,'Криворізька загальноосвітня школа І-ІІІ ступенів № 84 Криворізької міської ради Дніпропетровської області','Бабіч Тамара Григорівна',3,'442-05-44');
INSERT INTO `school` VALUES (174,'Криворізька загальноосвiтня школа І-ІІІ ступенів № 87 Криворізької міської ради Дніпропетровської області','Бабенко Тетяна Леонтіївна',3,'72-14-48');
INSERT INTO `school` VALUES (175,'Криворізька загальноосвiтня школа І-ІІІ ступенів № 88 Криворізької міської ради Дніпропетровської області','Ярмак Ірина Анатоліївна',3,'72-13-23');
INSERT INTO `school` VALUES (176,'Криворізька загальноосвiтня школа І-ІІІ ступенів № 89 Криворізької міської ради Дніпропетровської області','Балюк Валентина Іванівна',3,'442-05-73');
INSERT INTO `school` VALUES (177,'Криворізька загальноосвiтня школа І-ІІІ ступенів № 90 Криворізької міської ради Дніпропетровської області','Грищенко Людмила Дмитрівна',3,'71-11-34');
INSERT INTO `school` VALUES (178,'Криворізька загальноосвiтня школа І-ІІІ ступенів № 108 Криворізької міської ради Дніпропетровської області','Стешина Людмила Олександрівна',3,'71-21-46');
INSERT INTO `school` VALUES (179,'Криворізька загальноосвiтня школа І-ІІІ ступенів № 109 Криворізької міської ради Дніпропетровської області','Кіслов Сергій Юрійович',3,'71-12-15');
INSERT INTO `school` VALUES (180,'Криворiзька загальноосвітня школа І-ІІІ ступенів № 128 Криворізької міської ради Дніпропетровської області','Остапенко Світлана Василівна',3,'91-47-47');
INSERT INTO `school` VALUES (181,'Криворізький гуманітарно-технічний ліцей № 129 Криворізької міської ради Дніпропетровської області','Погрібна Нелля Сергіївна',3,'72-14-35');
INSERT INTO `school` VALUES (182,'Криворізька загальноосвiтня школа І-ІІІ ступенів № 130 Криворізької міської ради Дніпропетровської області','Яковлева Тетяна Анатоліївна',3,'91-52-30');
INSERT INTO `school` VALUES (183,'Комунальний заклад «Спеціалізований навчально-виховний комплекс «Дошкільний навчальний заклад - загальноосвітня школа І ступеня» з поглибленим вивченням іноземних мов художньо-естетичного напряму № 22»','Зотова Роза Миколаївна',5,'95-74-43');
INSERT INTO `school` VALUES (184,'Криворізька загальноосвітня школа І-ІІІ ступенів № 32 Криворізької міської ради Дніпропетровської області','Волик Альона Володимирівна',5,'95-33-04');
INSERT INTO `school` VALUES (185,'Криворізька загальноосвітня школа І-ІІІ ступенів № 33 Криворізької міської ради Дніпропетровської області','Комісар Валентина Олександрівна',5,'95-30-54');
INSERT INTO `school` VALUES (186,'Криворізька загальноосвітня школа І-ІІІ ступенів № 34 Криворізької міської ради Дніпропетровської області','Кольчиба Андрій Петрович',5,'66-48-12');
INSERT INTO `school` VALUES (187,'Криворізька загальноосвітня школа І-ІІІ ступенів № 36 Криворізької міської ради Дніпропетровської області','Шведова Ольга Анатоліївна',5,'53-03-85');
INSERT INTO `school` VALUES (188,'Криворізька загальноосвітня школа І-ІІІ ступенів № 44 Криворізької міської ради Дніпропетровської області0','Маханько Олена Анатоліївна',5,'66-29-71');
INSERT INTO `school` VALUES (189,'Криворізька загальноосвітня школа І-ІІІ ступенів № 46 Криворізької міської ради Дніпропетровської області','Семюк Інна Артемівна',5,'51-03-63');
INSERT INTO `school` VALUES (190,'Криворізька гімназія № 49 Криворізької міської ради Дніпропетровської області','Тимофієва Людмила Євграфівна',5,'407-28-79');
INSERT INTO `school` VALUES (191,'Криворізька загальноосвітня школа І-ІІІ ступенів № 52 Криворізької міської ради Дніпропетровської області','Деркач Вікторія Володимирівна',5,'66-13-01');
INSERT INTO `school` VALUES (193,'Криворізька загальноосвітня школа І-ІІІ ступенів № 57 Криворізької міської ради Дніпропетровської області','Кривокульська Любов Дмитрівна',5,'53-01-31');
INSERT INTO `school` VALUES (194,'Криворізька загальноосвітня школа І-ІІІ ступенів № 62 Криворізької міської ради Дніпропетровської області','Коваленко Олена Іванівна',5,'53-11-90');
INSERT INTO `school` VALUES (195,'Криворізька спеціалізована школа з поглибленим вивчення іноземних мов № 71 Криворізької міської ради Дніпропетровської області','Ткаченко Наталя Олексіївна',5,'53-50-23');
INSERT INTO `school` VALUES (196,'Криворізька загальноосвітня школа І-ІІІ ступенів № 86 Криворізької міської ради Дніпропетровської області','Католіченко Лілія Олександрівна',5,'66-13-03');
INSERT INTO `school` VALUES (197,'Криворізька загальноосвітня школа І-ІІІ ступенів № 93 Криворізької міської ради Дніпропетровської області','Шеляг Михайло Леонідович',5,'51-12-02');
INSERT INTO `school` VALUES (198,'Криворізька загальноосвітня школа І-ІІІ ступенів № 97 Криворізької міської ради Дніпропетровської області','Мацкович Ольга Анатоліївна',5,'53-31-68');
INSERT INTO `school` VALUES (199,'Криворізька загальноосвітня школа І-ІІІ ступенів № 111 Криворізької міської ради Дніпропетровської області','Берднікова Світлана Григорівна',5,'51-01-72');
INSERT INTO `school` VALUES (200,'Криворізька загальноосвітня школа І-ІІІ ступенів № 112 Криворізької міської ради Дніпропетровської області','Веклич Наталія Миколаївна',5,'53-30-10');
INSERT INTO `school` VALUES (201,'Криворізька загальноосвітня школа І-ІІІ ступенів № 121 Криворізької міської ради Дніпропетровської області','Парахіна Сусанна Володимирівна',5,'95-26-74');
INSERT INTO `school` VALUES (202,'Криворізька загальноосвітня школа І-ІІІ ступенів № 125 Криворізької міської ради Дніпропетровської області','Максименко Валентина Володимирівна',5,'95-76-28');
INSERT INTO `school` VALUES (203,'Криворізька загальноосвітня школа І-ІІІ ступенів № 126 Криворізької міської ради Дніпропетровської області','Грицун Ірина Іванівна',5,'95-76-27');
INSERT INTO `school` VALUES (204,'Криворізький Жовтнeвий ліцей','Бабова Наталія Станіславівна',5,'53-13-00');
INSERT INTO `school` VALUES (205,'Комунальний заклад освіти "Криворізький багатопрофільний навчально-реабілітаційний центр "Натхнення" Дніпропетровської обласної ради','Шевченко Наталія Петрівна',5,'53-01-83');
INSERT INTO `school` VALUES (206,'Криворізька загальноосвітня школа-інтернат І-ІІ ступенів № 4','Балєва Оксана Олександрівна',5,'53-31-74');
INSERT INTO `school` VALUES (207,'Обласний комунальний заклад освіти "Криворізька спеціалізована загальноосвітня школа-інтернат «Надія»','Полонська Надія Володимирівна',5,'95-72-53');
INSERT INTO `school` VALUES (208,'Комунальний заклад освіти "Багатопрофільний навчально-реабілітаційний центр "Сузір’я" ДОР','Луценко Любов Миколаївна',5,'66-34-57');
INSERT INTO `school` VALUES (209,'Комунальний заклад освіти «Криворізький обласний ліцей-інтернат для сільської молоді','Козаченко Ігор Олександрович',5,'53-02-40');
INSERT INTO `school` VALUES (210,'Криворізька загальноосвітня школа І-ІІІ ступенів № 59 Криворізької міської ради Дніпропетровської області','Дворікова Ольга Леонідівна',7,'22-17-52');
INSERT INTO `school` VALUES (211,'Криворізька загальноосвітня школа І-ІІІ ступенів № 67 Криворізької міської ради Дніпропетровської області','Максименко Лілія Василівна',7,'403-78-11');
INSERT INTO `school` VALUES (212,'Криворізька загальноосвітня школа І-ІІІ ступенів № 73 Криворізької міської ради Дніпропетровської області','Молчанова Галина Павлівна',7,'21-13-08');
INSERT INTO `school` VALUES (213,'Криворізька загальноосвітня школа І-ІІІ ступенів № 82 Криворізької міської ради Дніпропетровської області','Логонюк Олена Володимирівна',7,'21-12-72');
INSERT INTO `school` VALUES (214,'Криворізька загальноосвітня школа І-ІІІ ступенів № 92 Криворізької міської ради Дніпропетровської області','Бобровицька Наталія Володимирівна',7,'21-17-57');
INSERT INTO `school` VALUES (215,'Криворізька загальноосвітня школа І-ІІІ ступенів № 99 Криворізької міської ради Дніпропетровської області','Серченя Сергій Сергійович',7,'22-00-51');
INSERT INTO `school` VALUES (216,'Криворізька загальноосвітня школа І-ІІІ ступенів № 100 Криворізької міської ради Дніпропетровської області','Швидка Інна Григорівна',7,'22-23-54');
INSERT INTO `school` VALUES (217,'Криворізька загальноосвітня школа І-ІІ ступенів № 101 Криворізької міської ради Дніпропетровської області','Дуда Наталія Володимирівна',7,'462-65-06');
INSERT INTO `school` VALUES (218,'Криворізька загальноосвітня школа І-ІІІ ступенів № 102 Криворізької міської ради Дніпропетровської області','Крюкова Ірина Миколаївна',7,'22-01-06');
INSERT INTO `school` VALUES (219,'Криворізька загальноосвітня школа І-ІІІ ступенів № 114 Криворізької міської ради Дніпропетровської області','Хорькова Людмила Василівна',7,'22-11-50');
INSERT INTO `school` VALUES (220,'Криворізька загальноосвітня школа І-ІІІ ступенів № 115 Криворізької міської ради Дніпропетровської області','Плотніков Сергій Володимирович',7,'21-12-41');
INSERT INTO `school` VALUES (221,'Криворізька гімназія № 127 Криворізької міської ради Дніпропетровської області','Воробйова Антоніна Анатоліївна',7,'22-17-28');
INSERT INTO `school` VALUES (222,'Комунальний заклад освіти "Криворізький багатопрофільний навчально-реабілітаційний центр "Перлина" Дніпропетровської обласної ради"','Ільчук Ольга Володимирівна',7,'22-07-84');
INSERT INTO `school` VALUES (223,'Обласний комунальний заклад освіти "Криворізька загальноосвітня санаторна школа-інтернат № 5 І-ІІІ ступенів"','Младьонов Олександр Павлович',7,'22-37-20');
INSERT INTO `school` VALUES (224,'Комунальний навчально-виховний комплекс "Загальноосвітня школа-інтернат І-ІІІ ступенів № 9 з посиленою спртивною підготовкою" Криворізької міської ради','Кутаєв Олександр Миколайович',7,'21-17-91');
INSERT INTO `school` VALUES (225,'Комунальний заклад "Навчально-виховний комплекс "Дитячий садок-початкова школа № 240"','Швець Олена Миколаївна',4,'65-46-75');
INSERT INTO `school` VALUES (227,'Криворізька загальноосвітня школа І-ІІІ ступенів № 14 Криворізької міської ради Дніпропетровської області','Кашель Світлана Дем’янівна',4,'64-50-77');
INSERT INTO `school` VALUES (228,'Криворізька загальноосвітня школа І-ІІІ ступенів № 17 Криворізької міської ради Дніпропетровської області','Лагутіна Ольга Вікторівна',4,'26-66-98');
INSERT INTO `school` VALUES (229,'Криворізька загальноосвітня школа І-ІІІ ступенів № 19 Криворізької міської ради Дніпропетровської області','Євдокимова Тамара Василівна',4,'64-71-61');
INSERT INTO `school` VALUES (230,'Криворізька загальноосвітня школа І-ІІІ ступенів № 21 Криворізької міської ради Дніпропетровської області','Миргородська Анжеліна Борисівна',4,'65-38-33');
INSERT INTO `school` VALUES (231,'Криворізька загальноосвітня школа І-ІІІ ступенів № 31 Криворізької міської ради Дніпропетровської області','Галай Світлана Володимирівна',4,'64-20-31');
INSERT INTO `school` VALUES (232,'Криворізький навчально-виховний комплекс № 35 "Загальноосвітня школа І-ІІІ ступенів - багатопрофільний ліцей "Імпульс"','Лисенко Раїса Степанівна',4,'65-60-88');
INSERT INTO `school` VALUES (233,'Криворізька загальноосвітня школа І-ІІІ ступенів № 41 Криворізької міської ради Дніпропетровської області','Рогаль Андрій Миронович',4,'65-47-26');
INSERT INTO `school` VALUES (234,'Криворізька загальноосвітня школа І-ІІІ ступенів № 43 Криворізької міської ради Дніпропетровської області','Проскурникова Еліна Георгіївна',4,'65-00-64');
INSERT INTO `school` VALUES (235,'Криворізька загальноосвітня школа І-ІІІ ступенів № 51 Криворізької міської ради Дніпропетровської області','Щукіна Віта Жоржівна',4,'50-21-31');
INSERT INTO `school` VALUES (236,'Криворізька загальноосвітня школа І-ІІІ ступенів № 58 Криворізької міської ради Дніпропетровської області','Хора Юрій Петрович',4,'64-11-32');
INSERT INTO `school` VALUES (237,'Криворізька загальноосвітня школа І-ІІІ ступенів № 68 Криворізької міської ради Дніпропетровської області','Камлик Людмила Яківна',4,'408-18-51');
INSERT INTO `school` VALUES (238,'Криворізька спеціалізована школа І-ІІІ ступенів № 70 Криворізької міської ради Дніпропетровської області','Бондарук Володимир Олексійович',4,'74-13-30');
INSERT INTO `school` VALUES (239,'Криворізька загальноосвітня школа І-ІІІ ступенів № 72 Криворізької міської ради Дніпропетровської області','Ничипорук Вікторія Володимирівна',4,'64-25-15');
INSERT INTO `school` VALUES (240,'Криворізька спеціалізована школа І-ІІІ ступенів № 74 Криворізької міської ради Дніпропетровської області','Драч Оксана Павлівна',4,'65-70-51');
INSERT INTO `school` VALUES (241,'Криворізька гімназія № 91 Криворізької міської ради Дніпропетровської області','Бєлікова Тетяна Борисівна',4,'64-33-22');
INSERT INTO `school` VALUES (242,'Криворізька спеціалізована школа І-ІІІ ступенів № 107 з поглибленим вивченням англійської мови','Мазін Михайло Леонідович',4,'64-15-42');
INSERT INTO `school` VALUES (243,'Криворізька загальноосвітня школа І-ІІІ ступенів № 113 Криворізької міської ради Дніпропетровської області','Дегтярова Людмила Іванівна',4,'65-28-82');
INSERT INTO `school` VALUES (244,'Криворізька спеціалізована школа І-ІІІ ступенів № 118 Криворізької міської ради Дніпропетровської області','Чернякова Оксана Анатоліївна',4,'65-14-66');
INSERT INTO `school` VALUES (245,'Криворізька загальноосвітня школа І-ІІІ ступенів № 119 Криворізької міської ради Дніпропетровської області','Добровольська Ольга Вячеславівна',4,'65-38-32');
INSERT INTO `school` VALUES (246,'Криворізька загальноосвітня школа І-ІІІ ступенів № 120 Криворізької міської ради Дніпропетровської області','Клюкач Людмила Василівна',4,'64-74-02');
INSERT INTO `school` VALUES (247,'Криворізька загальноосвітня школа І-ІІІ ступенів № 122 Криворізької міської ради Дніпропетровської області','Федоринова Наталія Євгенівна',4,'64-31-07');
INSERT INTO `school` VALUES (248,'Криворізька загальноосвітня школа І-ІІІ ступенів № 124 Криворізької міської ради Дніпропетровської області','Вербицька Олександра Віталіївна',4,'408-17-56');
INSERT INTO `school` VALUES (249,'Криворізький природничо-науковий ліцей Криворізької міської ради Дніпропетровської області','Башук Любов Вікторівна',4,'64-23-35');
INSERT INTO `school` VALUES (250,'Обласний комунальний заклад освіти «Криворізька загальноосвітня школа-інтернат №7 І-ІІ ступенів»','Дорота Вікторія Леонідівна',4,'64-02-10');
INSERT INTO `school` VALUES (251,'Комунальний заклад освіти "Криворізький ліцей з посиленою військово-фізичною підготовкою"','Козлов Геннадій Олександрович',4,'74-82-82');
INSERT INTO `school` VALUES (252,'Криворізький навчально-виховний комплекс "Загальноосвітня школа І-ІІ ступенів - дошкільний навчальний заклад" № 38','Багоцька Тетяна Павлівна',6,'36-82-66');
INSERT INTO `school` VALUES (253,'Kомунальний заклад «Навчально - виховний комплекс «Дошкільний навчальний заклад комбінованого типу - загальноосвітня школа І ступеня» № 218» Криворізької міської ради','Слабоуз Алла Іллівна',6,'35-40-81');
INSERT INTO `school` VALUES (254,'Kомунальний заклад «Навчально-виховний комплекс «Дошкільний навчальний заклад комбінованого типу - загальноосвітня школа І ступеня» № 291» Криворізької міської ради','Дворніченко Тетяна Володимирівна',6,'36-33-94');
INSERT INTO `school` VALUES (255,'Криворізька загальноосвітня школа І-ІІІ ступенів № 27 Криворізької міської ради Дніпропетровської області','Куріченко Ірма Анатоліївна',6,'36-34-71');
INSERT INTO `school` VALUES (256,'Криворізька загальноосвітня школа І-ІІІ ступенів № 37 Криворізької міської ради Дніпропетровської області','Пивовар Світлана Василівна',6,'36-84-88');
INSERT INTO `school` VALUES (257,'Криворізька загальноосвітня школа І-ІІІ ступенів № 40 Криворізької міської ради Дніпропетровської області','Устинова Ольга Григорівна',6,'35-20-38');
INSERT INTO `school` VALUES (258,'Криворізька загальноосвітня школа І-ІІІ ступенів № 42 Криворізької міської ради Дніпропетровської області','Корнєва Альона Олександрівна',6,'36-81-97');
INSERT INTO `school` VALUES (259,'Криворiзька загальноосвітня школа І-ІІІ ступенів № 45 Криворізької міської ради Дніпропетровської області','Пархоменко Людмила Леонідівна',6,'36-82-67');
INSERT INTO `school` VALUES (260,'Криворізька загальноосвітня школа І-ІІІ ступенів № 48 Криворізької міської ради Дніпропетровської області','Лузан Ольга Олексіївна',6,'35-03-21');
INSERT INTO `school` VALUES (261,'Криворізька загальноосвітня школа І-ІІІ ступенів № 50 Криворізької міської ради Дніпропетровської області','Нікішина Олена Олексіївна',6,'35-76-03');
INSERT INTO `school` VALUES (262,'Криворізька загальноосвітня школа І-ІІІ ступенів № 55 Криворізької міської ради Дніпропетровської області','Горевич Людмила Володимирівна',6,'36-15-39');
INSERT INTO `school` VALUES (263,'Криворізька загальноосвітня школа І-ІІІ ступенів № 61 Криворізької міської ради Дніпропетровської області','Галітська Олена Вікторівна',6,'51-21-21');
INSERT INTO `school` VALUES (264,'Криворізька загальноосвітня школа І-ІІІ ступенів № 76 Криворізької міської ради Дніпропетровської області','Куцевол Інна Леонідівна',6,'406-70-19');
INSERT INTO `school` VALUES (265,'Криворiзька Тернівська гімназія Криворізької міської ради Дніпропетровської області','Дегтяренко Вікторія Василівна',6,'38-87-73');
INSERT INTO `school` VALUES (266,'Криворізька загальноосвітня школа І-ІІІ ступенів № 78 Криворізької міської ради Дніпропетровської області','Дьоміна Олена Іванівна',6,'35-01-22');
INSERT INTO `school` VALUES (267,'Kомунальний заклад "Навчально-виховний комплекс Криворізька загальноосвітня школа І-ІІ ступенів - дошкільний навчальний заклад № 83"','Ланкмілєр Любов Володимирівна',6,'36-75-43');
INSERT INTO `school` VALUES (268,'Комунальний заклад освіти Тернівський ліцей','Гавдан Антоніна Миколаївна',6,'35-00-31');
INSERT INTO `school` VALUES (269,'Криворізька загальноосвітня школа І-ІІІ ступенів № 105 Криворізької міської ради Дніпропетровської області','Баглай Олена Петрівна',6,'35-73-42');
INSERT INTO `school` VALUES (270,'Криворізька загальноосвітня школа І-ІІ ступенів № 106 Криворізької міської ради Дніпропетровської області','Сьоміна Ірина Григорівна',6,'35-10-81');
INSERT INTO `school` VALUES (271,'Криворізька загальноосвітня школа І-ІІІ ступенів № 110 Криворізької міської ради Дніпропетровської області','Туганова Олена Миколаївна',6,'38-01-93');
INSERT INTO `school` VALUES (272,'Криворізька загальноосвітня школа І-ІІІ ступенів № 116 Криворізької міської ради Дніпропетровської області','Тимофейшина Тетяна Леонідівна',6,'38-48-07');
INSERT INTO `school` VALUES (273,'Криворізька загальноосвітня школа І-ІІІ ступенів № 117 Криворізької міської ради Дніпропетровської області','Угліцька Олена Олексіївна',6,'38-44-23');
INSERT INTO `school` VALUES (274,'Обласний комунальний заклад освіти «Криворізька загальноосвітня санаторна школа-інтернат І-ІІ ступенів №8»','Карленко Наталія Вікторівна',6,'36-84-77');
INSERT INTO `school` VALUES (275,'Криворізька загальноосвітня школа І-ІІІ ступенів № 1 Криворізької міської ради Дніпропетровської області','Тагієва Любов Андріївна',1,'405-53-48');
INSERT INTO `school` VALUES (276,'Криворізька загальноосвітня школа І-ІІІ ступенів № 2 Криворізької міської ради Дніпропетровської області','Реріх Надія Михайлівна',1,'28-21-56');
INSERT INTO `school` VALUES (277,'Криворізька загальноосвітня школа І-ІІІ ступенів № 5 Криворізької міської ради Дніпропетровської області','Єрмоленко Павло Валерійович',1,'28-01-18');
INSERT INTO `school` VALUES (278,'Криворізька загальноосвітня школа І-ІІІ ступенів № 8 Криворізької міської ради Дніпропетровської області','Проскурова Ірина Петрівна',1,'90-07-15');
INSERT INTO `school` VALUES (279,'Криворізька загальноосвітня школа І-ІІІ ступенів № 10 Криворізької міської ради Дніпропетровської області','Панасенко Наталія Василівна',1,'90-85-71');
INSERT INTO `school` VALUES (280,'Криворізька загальноосвітня школа І-ІІІ ступенів № 12 Криворізької міської ради Дніпропетровської області','Варовей Любов Сергіївна',1,'27-14-40');
INSERT INTO `school` VALUES (281,'Криворізька загальноосвітня школа І-ІІІ ступенів № 13 Криворізької міської ради Дніпропетровської області','Медведєва Людмила Вікторівна',1,'28-43-63');
INSERT INTO `school` VALUES (282,'Криворізька спеціалізована загальноосвітня школа І-ІІІ ступенів № 20 з поглибленим вивченням німецької мови','Добровольська Олена Олександрівна',1,'90-28-34');
INSERT INTO `school` VALUES (283,'Криворізька загальноосвітня школа І-ІІІ ступенів № 22 Криворізької міської ради Дніпропетровської області','Теличко Клара Іллівна',1,'26-24-31');
INSERT INTO `school` VALUES (284,'Криворізька загальноосвітня школа І-ІІІ ступенів № 23 Криворізької міської ради Дніпропетровської області','Михайлов Артем Вікторович',1,'27-39-51');
INSERT INTO `school` VALUES (285,'Криворізька загальноосвітня школа І-ІІІ ступенів № 28 Криворізької міської ради Дніпропетровської області','Рижкова Марина Сергіївна',1,'28-09-79');
INSERT INTO `school` VALUES (286,'Криворізька загальноосвітня школа І-ІІІ ступенів № 29 Криворізької міської ради Дніпропетровської області','Олійникова Тетяна Михайлівна',1,'28-01-84');
INSERT INTO `school` VALUES (287,'Криворізька загальноосвітня школа І-ІІ ступенів № 30 Криворізької міської ради Дніпропетровської області','Янкіна Світлана Миколаївна',1,'28-00-47');
INSERT INTO `school` VALUES (288,'Криворізька загальноосвітня школа І-ІІІ ступенів № 39 Криворізької міської ради Дніпропетровської області','Фісун Ігор Миколайович',1,'22-31-41');
INSERT INTO `school` VALUES (289,'Криворізька загальноосвітня школа І-ІІІ ступенів № 60 Криворізької міської ради Дніпропетровської області','Малая Світлана Григорівна',1,'92-57-65');
INSERT INTO `school` VALUES (290,'Криворізька загальноосвітня школа І-ІІІ ступенів № 64 Криворізької міської ради Дніпропетровської області','Грибок Тетяна Валентинівна',1,'22-32-00');
INSERT INTO `school` VALUES (291,'Криворізька загальноосвітня школа І-ІІІ ступенів № 79 Криворізької міської ради Дніпропетровської області','Сивогракова Світлана Анатоліївна',1,'27-15-35');
INSERT INTO `school` VALUES (292,'Криворізька загальноосвітня школа І-ІІІ ступенів № 85 Криворізької міської ради Дніпропетровської області','Косяченко Надія Дмитрівна',1,'27-71-67');
INSERT INTO `school` VALUES (293,'Криворізька загальноосвітня школа І-ІІІ ступенів № 104 Криворізької міської ради Дніпропетровської області','Тетерін Олег Анатолійович',1,'477-27-20');
INSERT INTO `school` VALUES (294,'Криворізька загальноосвітня школа І-ІІІ ступенів № 123 Криворізької міської ради Дніпропетровської області','Паламар Олександра Георгіївна',1,'27-45-32');
INSERT INTO `school` VALUES (295,'Криворізький Центрально-Міський ліцей Криворізької міської ради Дніпропетровської області','Поручинський Павло Андрійович',1,'92-34-13');
INSERT INTO `school` VALUES (296,'Криворiзька Центрально-Міська гімназія Криворізької міської ради Дніпропетровської області','Хабло Євгенія Володимирівна',1,'90-06-05');
INSERT INTO `school` VALUES (297,'Криворізька вечірня школа №12 Криворізької міської ради Дніпропетровської області','Крісанова Олена Миколаївна',1,'27-39-31');
INSERT INTO `school` VALUES (298,'Комунальний заклад "Навчально-виховний комплекс "Криворiзька спеціалізована школа І-ІІІ ступенів із поглибленим вивченням іноземних мов - дошкільний навчальний заклад"','Коновалова Лариса Валеріївна',1,'90-37-07');
INSERT INTO `school` VALUES (299,'Криворізька загальноосвiтня школа І-ІІІ ступенів № 94 Криворізької міської ради Дніпропетровської області','Бородавка Сергій Миколайович',3,'71-55-43');
INSERT INTO `school` VALUES (11933,'Kомунальний заклад освіти «Криворізький багатопрофільний навчально-реабілітаційний центр № 1»','Перегинець Наталія Івнанівна',5,'51-03-52');
INSERT INTO `school` VALUES (11934,'Кoмунальний заклад "Навчально-виховний комплекс "Дошкільний навчальний заклад комбінованого типу - загальноосвітня школа І ступеню № 278"','Телєгіна Ірина Вікторівна',4,'65-35-16');
INSERT INTO `school` VALUES (11935,'Kомунальний заклад «Навчально-реабілітаційний центр» Криворізький міської ради Дніпропетровської області','Любченко Тетяна Анатоліївна',5,'95-63-86');
EOT;
        return $data;
    }
}
