<?php

use yii\db\Migration;

class m160224_162242_import_kindergarten extends Migration
{
    public function safeUp()
    {
        $this->execute("
            create table kindergarten(
                id integer primary key,
                name text,
                boss text,
                code_reg integer,
                phone text
            );
        ");

        foreach(explode(PHP_EOL, $this->_getItemsOfKindergarten()) as $line) {
            $this->execute($line);
        }

        $this->createIndex('kindergarten_fk_reg', 'kindergarten', 'code_reg');
    }

    public function safeDown()
    {
        return true;
    }

    private function _getItemsOfKindergarten()
    {
        $data =<<<EOT
INSERT INTO `kindergarten` VALUES (1,'Комунальний комбінований дошкільний навчальний заклад № 13','Луценко Вікторія Володимирівна',2,'405-41-60');
INSERT INTO `kindergarten` VALUES (2,'Комунальний дошкільний навчальний заклад № 15 загального розвитку','Романщак Валентина Володимирівна',2,'90-76-13');
INSERT INTO `kindergarten` VALUES (3,'Комунальний дошкільний навчальний заклад № 44 загального розвитку','Балинська Світлана Григорівна',2,'26-62-13');
INSERT INTO `kindergarten` VALUES (4,'Комунальний дошкільний навчальний заклад № 51 загального розвитку','Яцко Таїсія Борисівна',2,'92-76-76');
INSERT INTO `kindergarten` VALUES (5,'Комунальний дошкільний навчальний заклад № 79','Глушко Любов Михайлівна',2,'90-61-83');
INSERT INTO `kindergarten` VALUES (6,'Комунальний дошкільний навчальний заклад № 82 компенсуючого типу','Костецька Вікторія Миколаївна',2,'90-78-43');
INSERT INTO `kindergarten` VALUES (7,'Комунальний комбінований дошкільний виховний заклад № 102','Голосна Жанна Володимирівна',2,'71-71-77');
INSERT INTO `kindergarten` VALUES (8,'Комунальний спеціальний дошкільний навчальний заклад № 120','Барилекно Олена Анатоліївна',2,'71-44-54');
INSERT INTO `kindergarten` VALUES (9,'Комунальний дошкільний навчальний заклад № 123 загального розвитку','Гончарова Лариса Дмитрівна',2,'71-11-73');
INSERT INTO `kindergarten` VALUES (10,'Комунальний дошкільний навчальний заклад № 129 загального розвитку','Шевчук Людмила Анатоліївна',2,'71-53-55');
INSERT INTO `kindergarten` VALUES (11,'Комунальний дошкільний навчальний заклад № 136 загального розвитку','Сковородко Оксана Вікторівна',2,'404-22-12');
INSERT INTO `kindergarten` VALUES (12,'Комунальний спеціальний дошкільний навчальний заклад № 147','Щербанюк Юлія Вадимівна',2,'71-00-24');
INSERT INTO `kindergarten` VALUES (13,'Комунальний спеціальний дошкільний навчальний заклад № 148 (порушення опорно-рухового апарату)','Білобородова Світлана Анатоліївна',2,'71-00-40');
INSERT INTO `kindergarten` VALUES (14,'Комунальний дошкільний навчальний заклад № 180 загального розвитку','Лазарєва Наталія Павлівна',2,'74-54-43');
INSERT INTO `kindergarten` VALUES (15,'Комунальний санаторний дошкільний навчальний заклад № 186','Кучір Анжеліка Володимирівна',2,'90-76-11');
INSERT INTO `kindergarten` VALUES (16,'Комунальний дошкільний навчальний заклад № 189 загального розвитку','Темник Ірина Романівна',2,'90-64-80');
INSERT INTO `kindergarten` VALUES (17,'Комунальний дошкільний навчальний заклад № 225 загального розвитку','Зайцева Олена Олександрівна',2,'90-71-02');
INSERT INTO `kindergarten` VALUES (18,'Комунальний комбінований дошкільний навчальний заклад № 231','Федоренко Ольга Федорівна',2,'74-84-92');
INSERT INTO `kindergarten` VALUES (19,'Комунальний комбінований дошкільний навчальний заклад № 241','Лещенко Ірина Олександрівна',2,'74-29-87');
INSERT INTO `kindergarten` VALUES (20,'Комунальний дошкільний навчальний заклад № 246 загального розвитку','Денисенко Катерина Сергіївна',2,'407-12-12');
INSERT INTO `kindergarten` VALUES (21,'Комунальний комбінований дошкільний навчальний заклад № 67','Попруга Лариса Леонідівна',3,'407-25-11');
INSERT INTO `kindergarten` VALUES (22,'Комунальний комбінований дошкільний навчальний заклад № 72','Руденко Ірина Василівна',3,'91-10-68');
INSERT INTO `kindergarten` VALUES (23,'Комунальний комбінований дошкільний навчальний заклад № 77','Романенко Наталія Петрівна',3,'91-66-75');
INSERT INTO `kindergarten` VALUES (24,'Комунальний комбінований дошкільний навчальний заклад № 88','Кузуб Ала Миколаївна',3,'407-27-17');
INSERT INTO `kindergarten` VALUES (25,'Комунальний дошкільний навчальний заклад № 92 загального розвитку','Нустрова Марина Геннадіївна',3,'71-92-35');
INSERT INTO `kindergarten` VALUES (26,'Комунальний дошкільний навчальний заклад № 93 загального розвитку','Гусакова Галина Аркадіївна',3,'470-05-02');
INSERT INTO `kindergarten` VALUES (27,'Комунальний санаторний дошкільний навчальний заклад № 111 (для тубінфікованих дітей)','Іванцова Вікторія Євгенівна',3,'72-02-35');
INSERT INTO `kindergarten` VALUES (28,'Комунальний дошкільний навчальний заклад № 116 загального розвитку','Миронова Лілія Володимирівна',3,'94-17-02');
INSERT INTO `kindergarten` VALUES (29,'Комунальний комбінований дошкільний навчальний заклад № 122','Кондакова Вікторія Борисівна',3,'442-03-48');
INSERT INTO `kindergarten` VALUES (30,'Комунальний дошкільний навчальний заклад № 128 загального розвитку','Новікова Ірина Миколаївна',3,'408-41-60');
INSERT INTO `kindergarten` VALUES (31,'Комунальний дошкільний навчальний заклад № 130 загального розвитку','Ковтун Вікторія Миколаївна',3,'408-40-81');
INSERT INTO `kindergarten` VALUES (32,'Комунальний дошкільний навчальний заклад № 133 загального розвитку','Шеремет Наталя Володимирівна',3,'94-27-02');
INSERT INTO `kindergarten` VALUES (33,'Комунальний комбінований дошкільний навчальний заклад № 162','Гавриш Галина Дмитрівна',3,'71-22-72');
INSERT INTO `kindergarten` VALUES (34,'Комунальний дошкільний навчальний заклад № 183 загального розвитку','Семенова Тамара Іванівна',3,'71-21-31');
INSERT INTO `kindergarten` VALUES (35,'Комунальний дошкільний навчальний заклад № 204','Хроленко Тетяна Іванівна',3,'71-23-75');
INSERT INTO `kindergarten` VALUES (36,'Комунальний комбінований дошкільний навчальний заклад № 210','Філіпова Людмила Анатоліївна',3,'408-42-56');
INSERT INTO `kindergarten` VALUES (37,'Комунальний комбінований дошкільний навчальний заклад № 227','Клименко Тетяна Іванівна',3,'71-20-62');
INSERT INTO `kindergarten` VALUES (38,'Комунальний комбінований дошкільний навчальний заклад № 236','Дворецька Наталія Миколаївна',3,'72-22-67');
INSERT INTO `kindergarten` VALUES (39,'Комунальний дошкільний навчальний заклад № 290 загального розвитку','Сиром’ятова Світлана Олександрівна',3,'72-33-80');
INSERT INTO `kindergarten` VALUES (40,'Комунальний дошкільний навчальний заклад № 25 загального розвитку','Басацька Лілія Петрівна',5,'95-91-48');
INSERT INTO `kindergarten` VALUES (41,'Комунальний санаторний дошкільний навчальний заклад № 26','Паученко Ольга Михайлівна',5,'26-79-81');
INSERT INTO `kindergarten` VALUES (42,'Комунальний комбінований дошкільний навчальний заклад № 29','Федорова Ірина Валеріївна',5,'66-01-20');
INSERT INTO `kindergarten` VALUES (43,'Комунальний дошкільний навчальний заклад № 31 загального розвитку','Міщук Людмила Анатоліївна',5,'493-10-79');
INSERT INTO `kindergarten` VALUES (44,'Комунальний комбінований дошкільний навчальний заклад № 33','Мовчан Алла Валентинівна',5,'95-32-97');
INSERT INTO `kindergarten` VALUES (45,'Комунальний комбінований дошкільний навчальний заклад № 60','Кузьма Наталія Віталіївна',5,'440-33-69');
INSERT INTO `kindergarten` VALUES (46,'Комунальний дошкільний навчальний заклад № 62 загального розвитку','Сівоха Світлана Леонідівна',5,'95-63-87');
INSERT INTO `kindergarten` VALUES (47,'Комунальний комбінований дошкільний навчальний заклад № 65 (порушення мови та психологічного розвитку)','Єсіна Ірина Борисівна',5,'95-76-51');
INSERT INTO `kindergarten` VALUES (48,'Комунальний комбінований дошкільний навчальний заклад № 71','Руда Надія Володимирівна',5,'442-61-01');
INSERT INTO `kindergarten` VALUES (49,'Комунальний заклад "Дошкільний навчальний заклад (ясла-садок) № 76" Криворізької міської ради','Пацюк Марія Миколаївна',5,'95-30-43');
INSERT INTO `kindergarten` VALUES (50,'Комунальний дошкільний навчальний заклад № 104 загального розвитку','Безпала Ірина Олександрівна',5,'95-63-87');
INSERT INTO `kindergarten` VALUES (51,'Комунальний дошкільний навчальний заклад № 106 загального розвитку','Хайнак Ольга Іванівна',5,'66-23-29');
INSERT INTO `kindergarten` VALUES (52,'Комунальний дошкільний навчальний заклад № 113 загального розвитку','Сахальова Ірина Василівна',5,'53-12-96');
INSERT INTO `kindergarten` VALUES (53,'Комунальний дошкільний навчальний заклад № 118 загального розвитку','Хрищенко Наталія Семенівна',5,'95-26-81');
INSERT INTO `kindergarten` VALUES (54,'Комунальний дошкільний навчальний заклад № 142 загального розвитку','Мастерова Ірина Михайлівна',5,'66-00-26');
INSERT INTO `kindergarten` VALUES (55,'Комунальний дошкільний навчальний заклад № 144 загального розвитку','Прокопчук Любов Іванівна',5,'50-39-95');
INSERT INTO `kindergarten` VALUES (56,'Комунальний комбінований дошкільний навчальний заклад № 175','Панчук Віта Борисівна',5,'66-12-16');
INSERT INTO `kindergarten` VALUES (57,'Комунальний дошкільний навчальний заклад № 184 загального розвитку','Бондаренко Тетяна Фогівна',5,'51-00-06');
INSERT INTO `kindergarten` VALUES (58,'Комунальний дошкільний навчальний заклад № 206 загального розвитку','Шеремет Лариса Петрівна',5,'53-41-89');
INSERT INTO `kindergarten` VALUES (59,'Комунальний комбінований дошкільний навчальний заклад № 224','Закусило Інна Анатоліївна',5,'53-00-22');
INSERT INTO `kindergarten` VALUES (60,'Комунальний комбінований дошкільний навчальний заклад № 230','Андрєєва Інна Миколаївна',5,'95-67-61');
INSERT INTO `kindergarten` VALUES (61,'Комунальний комбінований дошкільний навчальний заклад № 232','Науменко Наталья Григорівна',5,'95-39-33');
INSERT INTO `kindergarten` VALUES (62,'Комунальний комбінований дошкільний навчальний заклад № 238','Бичкова Марія Олексіївна',5,'53-41-27');
INSERT INTO `kindergarten` VALUES (63,'Комунальний дошкільний навчальний заклад № 247 загального розвитку','Доберчак Олена Володимирівна',5,'53-00-68');
INSERT INTO `kindergarten` VALUES (64,'Комунальний комбінований дошкільний навчальний заклад № 263','Дроздова Валентина Сергіївна',5,'65-32-11');
INSERT INTO `kindergarten` VALUES (65,'Комунальний дошкільний навчальний заклад № 270 загального розвитку','Рожкова Оксана Іванівна',5,'65-40-42');
INSERT INTO `kindergarten` VALUES (66,'Комунальний дошкільний навчальний заклад № 272 загального розвитку','Котяш Інна Володимирівна',5,'53-03-94');
INSERT INTO `kindergarten` VALUES (67,'Комунальний комбінований дошкільний навчальний заклад № 280','Якубовська Ірина Валентинівна',5,'66-38-24');
INSERT INTO `kindergarten` VALUES (68,'Комунальний дошкільний навчальний заклад № 28 загального розвитку','Купчик Тетяна Дмитрівна',7,'22-37-21');
INSERT INTO `kindergarten` VALUES (69,'Комунальний спеціальний дошкільний навчальний заклад № 83','Вигулярна Ольга Василівна',7,'21-16-60');
INSERT INTO `kindergarten` VALUES (70,'Дошкільний навчальний заклад № 85 загального розвитку','Полянська Лариса Миколаївна',7,'21-20-14');
INSERT INTO `kindergarten` VALUES (71,'Комунальний комбінований дошкільний навчальний заклад № 101','Коник Катерина Володимирівна',7,'21-15-41');
INSERT INTO `kindergarten` VALUES (72,'Комунальний дошкільний навчальний заклад № 132 загального розвитку','Суппіс Олена Василівна',7,'22-11-34');
INSERT INTO `kindergarten` VALUES (73,'Комунальний санаторний дошкільний навчальний заклад № 164 (для тубінфікованих дітей)','Дяченко Галина Василівна',7,'21-11-87');
INSERT INTO `kindergarten` VALUES (74,'Дошкільний навчальний заклад № 45 загального розвитку','Чудновець Алла Олександрівна',7,'21-13-49');
INSERT INTO `kindergarten` VALUES (75,'Дошкільний навчальний заклад № 87 загального розвитку','Томіліна Світлана Сергіївна',7,'22-80-68');
INSERT INTO `kindergarten` VALUES (76,'Комунальний комбінований дошкільний навчальний заклад № 127 (порушення мови та психологічного розвитку )','Нековаль Оксана Сергіївна',7,'22-23-24');
INSERT INTO `kindergarten` VALUES (77,'Комунальний комбінований дошкільний навчальний заклад № 141','Мельничук Олександра Іванівна',7,'22-17-69');
INSERT INTO `kindergarten` VALUES (78,'Комунальний дошкільний навчальний заклад № 155 загального розвитку','Князєва Тетяна Миколаївна',7,'21-70-59');
INSERT INTO `kindergarten` VALUES (79,'Комунальний комбінований дошкільний навчальний заклад № 161','Лошакова Лариса Станіславівна',7,'22-25-45');
INSERT INTO `kindergarten` VALUES (80,'Комунальний дошкільний навчальний заклад № 187 загального розвитку','Козенко Лариса Юріївна',7,'22-00-10');
INSERT INTO `kindergarten` VALUES (81,'Комунальний комбінований дошкільний навчальний заклад № 207','Алєксєєва Наталія Олександрівна',7,'406-93-00');
INSERT INTO `kindergarten` VALUES (82,'Комунальний дошкільний навчальний заклад № 255 загального розвитку','Бєлогрудова Ліліана Вадимівна',7,'22-02-65');
INSERT INTO `kindergarten` VALUES (83,'Комунальний дошкільний навчальний заклад № 257 загального розвитку','Жаворонкова Інна Сергіївна',7,'22-30-01');
INSERT INTO `kindergarten` VALUES (84,'Комунальний дошкільний навчальний заклад № 14 загального розвитку','Попова Тетяна Володимирівна',4,'65-51-55');
INSERT INTO `kindergarten` VALUES (85,'Комунальний дошкільний навчальний заклад № 30 загального розвитку','Панкевич Валентина Михайлівна',4,'64-94-59');
INSERT INTO `kindergarten` VALUES (86,'Дошкільний навчальний заклад № 32 загального розвитку','Курінна Наталія Дмитрівна',4,'64-42-00');
INSERT INTO `kindergarten` VALUES (87,'Комунальний дошкільний навчальний заклад № 42 загального розвитку','Кондратенко Ганна Олександрівна',4,'64-44-52');
INSERT INTO `kindergarten` VALUES (88,'Комунальний дошкільний навчальний заклад № 57 загального розвитку','Тарасенко Валентина Дмитрівна',4,'64-32-13');
INSERT INTO `kindergarten` VALUES (89,'Комунальний дошкільний навчальний заклад № 81 загального розвитку','Дзюба Тетяна Валентинівна',4,'66-62-43');
INSERT INTO `kindergarten` VALUES (90,'Комунальний дошкільний навчальний заклад № 89 загального розвитку','Байдак Наталія Григорівна',4,'65-29-64');
INSERT INTO `kindergarten` VALUES (91,'Комунальний санаторний дошкільний навчальний заклад № 90','Коваль Алла Анатоліївна',4,'64-23-11');
INSERT INTO `kindergarten` VALUES (92,'Комунальний спеціальний дошкільний навчальний заклад №151','Пирог Оксана Михайлівна',4,'64-70-13');
INSERT INTO `kindergarten` VALUES (93,'Комунальний санаторний дошкільний навчальний заклад № 156','Омельниченко Ольга Олександрівна',4,'64-92-02');
INSERT INTO `kindergarten` VALUES (94,'Комунальний дошкільний навчальний заклад № 190 загального розвитку','Нагній Алла Володимирівна',4,'65-52-31');
INSERT INTO `kindergarten` VALUES (95,'Комунальний дошкільний навчальний заклад № 191 загального розвитку','Ростовцева Наталія Олександрівна',4,'64-01-17');
INSERT INTO `kindergarten` VALUES (96,'Комунальний комбінований дошкільний навчальний заклад № 194','Штайнке Ірина Еріхівна',4,'64-41-23');
INSERT INTO `kindergarten` VALUES (97,'Комунальний дошкільний навчальний заклад № 197','Яковлєва Вікторія Костянтинівна',4,'64-10-35');
INSERT INTO `kindergarten` VALUES (98,'Комунальний комбінований дошкільний навчальний заклад № 202','Недєлько Олена Володимирівна',4,'64-21-32');
INSERT INTO `kindergarten` VALUES (99,'Комунальний дошкільний навчальний заклад № 222 загального розвитку','Клименко Олена Григорівна',4,'408-13-45');
INSERT INTO `kindergarten` VALUES (100,'Комунальний дошкільний навчальний заклад № 234 загального розвитку','Клевець Тетяна Олексіївна',4,'64-10-27');
INSERT INTO `kindergarten` VALUES (101,'Комунальний дошкільний навчальний заклад № 249 загального розвитку','Тищенко Тетяна Анатоліївна',4,'26-66-37');
INSERT INTO `kindergarten` VALUES (102,'Комбінований дошкільний навчальний заклад № 250 загального розвитку','Безсмольна Любов Дмитрівна',4,'65-70-45');
INSERT INTO `kindergarten` VALUES (103,'Комунальний дошкільний навчальний заклад № 254 загального розвитку загального розвитку','Тараненко Тетяна Володимирівна',4,'65-32-81');
INSERT INTO `kindergarten` VALUES (104,'Комунальний комбінований дошкільний навчальний заклад № 259','Чурілова Неля Миколаївна',4,'26-60-37');
INSERT INTO `kindergarten` VALUES (105,'Комунальний комбінований дошкільний навчальний заклад № 261','Шпак Наталія Олександрівна',4,'65-64-46');
INSERT INTO `kindergarten` VALUES (106,'Комунальний комбінований дошкільний навчальний заклад № 264','Майборода Вікторія Анатоліївна',4,'440-82-76');
INSERT INTO `kindergarten` VALUES (107,'Комунальний комбінований дошкільний навчальний заклад № 295','Семенова Алла Вікторівна',4,'65-64-41');
INSERT INTO `kindergarten` VALUES (108,'Комунальний дошкільний навчальний заклад № 300 загального розвитку','Понамарьова Галина Миколаївна',4,'64-72-20');
INSERT INTO `kindergarten` VALUES (109,'Комунальний дошкільний навчальний заклад № 301 загального розвитку','Волкова Тетяна Семенівна',4,'64-72-48');
INSERT INTO `kindergarten` VALUES (110,'Комунальний комбінований дошкільний навчальний заклад № 303','Борзьонок Лариса Іванівна',4,'65-32-80');
INSERT INTO `kindergarten` VALUES (111,'Комунальний заклад "Навчально-виховний комплекс "Криворізька спеціалізована школа І-ІІІ ступенів із поглибленим вивченням іноземних мов - дошкільний навчальний заклад"','Коновалова Лариса Валеріївна',1,'90-37-07');
INSERT INTO `kindergarten` VALUES (112,'Комунальний дошкільний навчальний заклад № 43 загального розвитку','Коновалова Олена Миколаївна',6,'36-15-40');
INSERT INTO `kindergarten` VALUES (113,'Комунальний дошкільний навчальний заклад № 54 загального розвитку','Євтушенко Світлана Леонідівна',6,'35-40-82');
INSERT INTO `kindergarten` VALUES (114,'Комунальний дошкільний навчальний заклад № 115 загального розвитку','Куралес Алла Анатоліївна',6,'51-87-60');
INSERT INTO `kindergarten` VALUES (115,'Комунальний дошкільний навчальний заклад № 125 загального розвитку','Сушко Оксана Петрівна',6,'36-32-49');
INSERT INTO `kindergarten` VALUES (116,'Комунальний комбінований дошкільний навчальний заклад № 145','Яковлева Тамара Миколаївна',6,'51-23-74');
INSERT INTO `kindergarten` VALUES (117,'Комунальний дошкільний навчальний заклад № 149 загального розвитку','Ганя Тетяна Миколаївна',6,'36-81-16');
INSERT INTO `kindergarten` VALUES (118,'Комунальний дошкільний навчальний заклад гуманітарного та художньо-естетичного профілю № 158','Мірскова Ірина Михайлівна',6,'38-35-94');
INSERT INTO `kindergarten` VALUES (119,'Комунальний комбінований дошкільний навчальний заклад № 176','Мальцева Ольга Василівна',6,'38-79-15');
INSERT INTO `kindergarten` VALUES (120,'Комунальний дошкільний навчальний заклад фізкультурно-оздоровчого профілю № 211','Щербачова Тетяна Анатоліївна',6,'35-40-23');
INSERT INTO `kindergarten` VALUES (121,'Комунальний дошкільний навчальний заклад № 215 загального розвитку','Даценко Олександра Петрівна',6,'35-40-80');
INSERT INTO `kindergarten` VALUES (122,'Комунальний заклад "Комбінований дошкільний навчальний заклад ясла-садок № 216"','Кофанова Тамара Миколаївна',6,'35-03-56');
INSERT INTO `kindergarten` VALUES (123,'Комунальний комбінований дошкільний навчальний заклад № 220','Колісник Євгенія Леонідівна',6,'35-71-63');
INSERT INTO `kindergarten` VALUES (124,'Комунальний комбінований дошкільний навчальний заклад № 235','Доценко Валентина Михайлівна',6,'38-48-11');
INSERT INTO `kindergarten` VALUES (125,'Комунальний дошкільний навчальний заклад № 239 загального розвитку','Синельникова Алла Олександрівна',6,'36-51-59');
INSERT INTO `kindergarten` VALUES (126,'Комунальний дошкільний навчальний заклад загального розвитку № 260','Куницька Марина Валеріївна',6,'38-05-41');
INSERT INTO `kindergarten` VALUES (127,'Комбінований дошкільний навчальний заклад № 271 загального розвитку','Павлюк Ганна Францівна',6,'36-51-56');
INSERT INTO `kindergarten` VALUES (128,'Комбінований дошкільний навчальний заклад № 1','Потрашкова Тетяна Миколаївна',1,'90-31-44');
INSERT INTO `kindergarten` VALUES (129,'Комунальний комбінований дошкільний навчальний заклад № 3','Кір’янова Ірина Юліївна',1,'92-54-20');
INSERT INTO `kindergarten` VALUES (130,'Комунальний комбінований дошкільний навчальний заклад № 4','Шайнога Валентина Володимирівна',1,'27-71-52');
INSERT INTO `kindergarten` VALUES (131,'Комунальний комбінований дошкільний навчальний заклад № 6','Яковлєва Олена Миколаївна',1,'27-71-54');
INSERT INTO `kindergarten` VALUES (132,'Комунальний дошкільний навчальний заклад № 17','Лещенко Тамара Миколаївна',1,'90-18-39');
INSERT INTO `kindergarten` VALUES (133,'Комунальний дошкільний навчальний заклад № 34 загального розвитку','Ісаєва Віра Іванівна',1,'27-57-13');
INSERT INTO `kindergarten` VALUES (134,'Комунальний дошкільний навчальний заклад № 38 загального розвитку','Мякушко Інна Іванівна',1,'28-01-28');
INSERT INTO `kindergarten` VALUES (135,'Комунальний дошкільний навчальний заклад № 39 загального розвитку','Журавльова Наталля Олександрівна',1,'462-12-41');
INSERT INTO `kindergarten` VALUES (136,'Комунальний дошкільний навчальний заклад № 64 загального розвитку','Деньгуб Валентина Павлівна',1,'22-31-41');
INSERT INTO `kindergarten` VALUES (137,'Комунальний комбінований дошкільний навчальний заклад № 70','Масалова Ольга Георгіївна',1,'90-20-65');
INSERT INTO `kindergarten` VALUES (138,'Комунальний дошкільний навчальний заклад № 80 загального розвитку','Гетман Наталія Михайлівна',1,'92-56-74');
INSERT INTO `kindergarten` VALUES (139,'Комунальний комбінований дошкільний навчальний заклад № 121','Чмир Тетяна Леонідівна',1,'26-24-16');
INSERT INTO `kindergarten` VALUES (140,'Комунальний дошкільний навчальний заклад № 160 загального розвитку','Стахів Олена Павлівна',1,'77-80-77');
INSERT INTO `kindergarten` VALUES (141,'Комунальний дошкільний навчальний заклад № 195 загального розвитку','Зеленська Галина Петрівна',1,'92-53-87');
INSERT INTO `kindergarten` VALUES (142,'Комунальний дошкільний навчальний заклад № 198 загального розвитку','Ляшенко Наталія Василівна',1,'26-26-41');
INSERT INTO `kindergarten` VALUES (143,'Комунальний дошкільний навчальний заклад № 199 загального розвитку','Садохіна Лариса Петрівна',1,'92-36-52');
INSERT INTO `kindergarten` VALUES (144,'Комунальний комбінований дошкільний навчальний заклад № 201','Штурко Наталія Федорівна',1,'27-48-14');
INSERT INTO `kindergarten` VALUES (145,'Комунальний комбінований дошкільний навчальний заклад № 294','Герасимова Алла Юріївна',1,'27-45-41');
INSERT INTO `kindergarten` VALUES (146,'Комунальний дошкільний навчальний заклад № 304','Віцалару Ірина Володимирівна',1,'27-48-53');
INSERT INTO `kindergarten` VALUES (147,'Комунальний комбінований дошкільний навчальний заклад № 306','Костенко Олена Андріївна',1,'28-00-13');
INSERT INTO `kindergarten` VALUES (148,'Комунальний комбінований дошкільний навчальний заклад № 75','Шульга Таїса Іванівна',6,'36-33-96');
INSERT INTO `kindergarten` VALUES (149,'Комунальний заклад «Навчально - виховний комплекс «Дошкільний навчальний заклад комбінованого типу - загальноосвітня школа І ступеня» № 218» Криворізької міської ради','Слабоуз Алла Іллівна',6,'35-40-81');
INSERT INTO `kindergarten` VALUES (150,'Комунальний заклад «Навчально-виховний комплекс «Дошкільний навчальний заклад комбінованого типу - загальноосвітня школа І ступеня» № 291» Криворізької міської ради','Дворніченко Тетяна Володимирівна',6,'36-33-94');
INSERT INTO `kindergarten` VALUES (151,'Комунальний дошкільний навчальний заклад №203 загального розвитку','Шершньова Тетяна Олексіївна',3,'71-00-49');
INSERT INTO `kindergarten` VALUES (152,'Криворізький навчально-виховний комплекс «Загальноосвітня Вальдорфська школа І-ІІІ ступенів - дитячий садок»','Шульц Валентина Леонідівна',3,'71-67-45');
INSERT INTO `kindergarten` VALUES (10702,'Комунальний заклад "Криворiзький навчально-виховний комплекс "Загальноосвiтня школа І-ІІ ступенів - дошкільний навчальний заклад" № 18','Шаврін Олександр Сергійович',2,'78-11-22');
INSERT INTO `kindergarten` VALUES (10707,'Спеціалiзований навчально-виховний комплекс "Дошкільний навчальний заклад - загальноосвітня школа І ступеня" з поглибленим вивченням іноземних мов художньо-естетичного напряму" № 22','Зотова Роза Миколаївна',5,'95-74-43');
INSERT INTO `kindergarten` VALUES (10709,'Криворiзький навчально-виховний комплекс "Загальноосвітня школа І-ІІ ступенiв - дошкільний навчальний заклад" № 38','Багоцька Тетяна Павлівна',6,'36-82-66');
INSERT INTO `kindergarten` VALUES (11919,'Комунальний заклад "Дошкільний навчальний заклад (ясла-садок) № 94 загального розвитку" Криворізької міської ради','Кравчук Тетяна Іванівна',2,'407-09-90');
INSERT INTO `kindergarten` VALUES (11920,'Kомунальний заклад "Навчально-виховний комплекс "Дитячий садок-початкова школа № 240"','Швець Олена Миколаївна',4,'65-46-75');
INSERT INTO `kindergarten` VALUES (11927,'Комунальний заклад "Навчально-виховний комплекс "Дошкільний навчальний заклад комбінованого типу - загальноосвітня школа І ступеню № 278"','Телєгіна Ірина Вікторівна',4,'65-35-16');
INSERT INTO `kindergarten` VALUES (11936,'Кoмунальний заклад «Навчально-реабілітаційний центр» Криворізький міської ради Дніпропетровської області','Любченко Тетяна Анатоліївна',5,'95-63-86');
INSERT INTO `kindergarten` VALUES (12655,'Комунальний заклад "Навчально-виховний комплекс "Криворізька загальноосвітня школа І-ІІ ступенів - дошкільний навчальний заклад №83"','Ланкмілєр Любов Володимирівна',6,'36-75-43');
EOT;
        return $data;
    }
}
